In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("E:\\DATA ANALYTICS ENGINEERING MASTERY COURSE\\PANDAS MATERIAL\\LondonHousingData.csv")

In [3]:
df.head(4)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN

In [4]:
df.shape

(13549, 6)

In [5]:
df.size

81294

In [6]:
df.index

RangeIndex(start=0, stop=13549, step=1)

In [7]:
df.columns

Index(['date', 'area', 'average_price', 'code', 'houses_sold', 'no_of_crimes'], dtype='object')

In [8]:
df.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [9]:
df.isnull().sum()*100/len(df)

date              0.000000
area              0.000000
average_price     0.000000
code              0.000000
houses_sold       0.693778
no_of_crimes     45.095579
dtype: float64

# So we have to impute no_of_crimes Column

In [10]:
df.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

In [11]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN

In [12]:
df['no_of_crimes'].fillna(df['no_of_crimes'].mean(),inplace=True)
df['houses_sold'].fillna(df['houses_sold'].mean(),inplace=True)

In [13]:
df.isnull().sum()

date             0
area             0
average_price    0
code             0
houses_sold      0
no_of_crimes     0
dtype: int64

# Convert The Datatypes of date columns in Datetime format

In [14]:
df['date']=pd.to_datetime(df['date'])

In [15]:
df.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

In [16]:
df['date'].value_counts()

1998-04-01    47
1996-02-01    47
1997-11-01    45
2006-02-01    45
2008-04-01    45
              ..
1998-08-01    45
2016-06-01    45
2000-01-01    45
1995-01-01    45
2017-02-01    45
Name: date, Length: 301, dtype: int64

# Add a Year Column in Dataset

In [17]:
df['year'] = pd.to_datetime(df['date']).dt.year

In [18]:
df.head(9)

,date,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,city of london,91449,E09000001,17.0,2158.352063,1995
1,1995-02-01,city of london,82203,E09000001,7.0,2158.352063,1995
2,1995-03-01,city of london,79121,E09000001,14.0,2158.352063,1995
3,1995-04-01,city of london,77101,E09000001,7.0,2158.352063,1995
4,1995-05-01,city of london,84409,E09000001,10.0,2158.352063,1995
5,1995-06-01,city of london,94901,E09000001,17.0,2158.352063,1995
6,1995-07-01,city of london,110128,E09000001,13.0,2158.352063,1995
7,1995-08-01,city of london,112329,E09000001,14.0,2158.352063,1995
8,1995-09-01,city of london,104473,E09000001,17.0,2158.352063,1995

# Add a Month Column in Dataset

In [19]:
df['month'] = pd.to_datetime(df['date']).dt.month

In [20]:
df.head(9)

,date,area,average_price,code,houses_sold,no_of_crimes,year,month
0,1995-01-01,city of london,91449,E09000001,17.0,2158.352063,1995,1
1,1995-02-01,city of london,82203,E09000001,7.0,2158.352063,1995,2
2,1995-03-01,city of london,79121,E09000001,14.0,2158.352063,1995,3
3,1995-04-01,city of london,77101,E09000001,7.0,2158.352063,1995,4
4,1995-05-01,city of london,84409,E09000001,10.0,2158.352063,1995,5
5,1995-06-01,city of london,94901,E09000001,17.0,2158.352063,1995,6
6,1995-07-01,city of london,110128,E09000001,13.0,2158.352063,1995,7
7,1995-08-01,city of london,112329,E09000001,14.0,2158.352063,1995,8
8,1995-09-01,city of london,104473,E09000001,17.0,2158.352063,1995,9

# Remove the Year and Month Column from the dataset

In [21]:
df.drop(columns=['year','month'],inplace=True)

In [22]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,2158.352063
1,1995-02-01,city of london,82203,E09000001,7.0,2158.352063

# Show all the reords where no_of_crimes is zero and how many such records are there ?

In [23]:
df[df['no_of_crimes']==0].count()

date             104
area             104
average_price    104
code             104
houses_sold      104
no_of_crimes     104
dtype: int64

# What is the maximum and minimum average price per year in England?

In [24]:
df.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,2158.352063

In [25]:
s=df[df['area']=='england']

In [26]:
s

,date,area,average_price,code,houses_sold,no_of_crimes
13248,1995-01-01,england,53203,E92000001,47639.000000,2158.352063
13249,1995-02-01,england,53096,E92000001,47880.000000,2158.352063
13250,1995-03-01,england,53201,E92000001,67025.000000,2158.352063
13251,1995-04-01,england,53591,E92000001,56925.000000,2158.352063
13252,1995-05-01,england,53678,E92000001,64192.000000,2158.352063
...,...,...,...,...,...,...
13544,2019-09-01,england,249942,E92000001,64605.000000,2158.352063
13545,2019-10-01,england,249376,E92000001,68677.000000,2158.352063
13546,2019-11-01,england,248515,E92000001,67814.000000,2158.352063
13547,2019-12-01,england,250410,E92000001,3893.994129,2158.352063
13548,2020-01-01,england,247355,E92000001,3893.994129,2158.352063

In [27]:
s.groupby('date').average_price.max().sort_values(ascending=False)

date
2019-12-01    250410
2019-09-01    249942
2019-08-01    249432
2019-10-01    249376
2018-08-01    248620
               ...
1995-10-01     52845
1995-11-01     52788
1996-03-01     52683
1996-02-01     52536
1996-01-01     52333
Name: average_price, Length: 301, dtype: int64

In [28]:
s.groupby('date').average_price.min().sort_values()

date
1996-01-01     52333
1996-02-01     52536
1996-03-01     52683
1995-11-01     52788
1995-10-01     52845
               ...
2018-08-01    248620
2019-10-01    249376
2019-08-01    249432
2019-09-01    249942
2019-12-01    250410
Name: average_price, Length: 301, dtype: int64

# What is the maximum & minimum no of crimes recorded per area

In [29]:
df.groupby('area').no_of_crimes.max()

area
barking and dagenham      2158.352063
barnet                    2893.000000
bexley                    2158.352063
brent                     2937.000000
bromley                   2637.000000
camden                    4558.000000
city of london            2158.352063
croydon                   3263.000000
ealing                    3401.000000
east midlands             2158.352063
east of england           2158.352063
enfield                   2798.000000
england                   2158.352063
greenwich                 2853.000000
hackney                   3466.000000
hammersmith and fulham    2645.000000
haringey                  3199.000000
harrow                    2158.352063
havering                  2158.352063
hillingdon                2819.000000
hounslow                  2817.000000
inner london              2158.352063
islington                 3384.000000
kensington and chelsea    2778.000000
kingston upon thames      2158.352063
lambeth                   4701.000000
lewisham                  2813.000000
london                    2158.352063
merton                    2158.352063
newham                    3668.000000
north east                2158.352063
north west                2158.352063
outer london              2158.352063
redbridge                 2560.000000
richmond upon thames      2158.352063
south east                2158.352063
south west                2158.352063
southwark                 3821.000000
sutton                    2158.352063
tower hamlets             3316.000000
waltham forest            2941.000000
wandsworth                3051.000000
west midlands             2158.352063
westminster               7461.000000
yorks and the humber      2158.352063
Name: no_of_crimes, dtype: float64

# Show the total count of records of each area , where average price is less than 100000

In [30]:
df.head(1)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,2158.352063

In [31]:
x=df[df['average_price']<100000]

In [32]:
x.groupby('area').count()

                      date  average_price  code  houses_sold  no_of_crimes
area
barking and dagenham    85             85    85           85            85
barnet                  25             25    25           25            25
bexley                  64             64    64           64            64
brent                   40             40    40           40            40
bromley                 33             33    33           33            33
city of london          11             11    11           11            11
croydon                 57             57    57           57            57
ealing                  31             31    31           31            31
east midlands           96             96    96           96            96
east of england         76             76    76           76            76
enfield                 54             54    54           54            54
england                 87             87    87           87            87
greenwich               59             59    59           59            59
hackney                 53             53    53           53            53
haringey                33             33    33           33            33
harrow                  30             30    30           30            30
havering                60             60    60           60            60
hillingdon              44             44    44           44            44
hounslow                41             41    41           41            41
inner london            31             31    31           31            31
islington               19             19    19           19            19
kingston upon thames    30             30    30           30            30
lambeth                 41             41    41           41            41
lewisham                62             62    62           62            62
london                  39             39    39           39            39
merton                  35             35    35           35            35
newham                  72             72    72           72            72
north east             112            112   112          112           112
north west             111            111   111          111           111
outer london            46             46    46           46            46
redbridge               52             52    52           52            52
south east              59             59    59           59            59
south west              78             78    78           78            78
southwark               48             48    48           48            48
sutton                  54             54    54           54            54
tower hamlets           47             47    47           47            47
waltham forest          64             64    64           64            64
wandsworth              26             26    26           26            26
west midlands           94             94    94           94            94
yorks and the humber   110            110   110          110           110

In [33]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,2158.352063
1,1995-02-01,city of london,82203,E09000001,7.0,2158.352063

# Top 6 Area In Which Area Most Houses Sold ?

In [34]:
df.groupby('area').houses_sold.max().sort_values(ascending=False).head(6)

area
england            132163.0
south east          23418.0
london              18420.0
north west          17383.0
east of england     15547.0
south west          14506.0
Name: houses_sold, dtype: float64

# Top 6 Date In Which Area Most Houses Sold ?

In [35]:
df.groupby('date').houses_sold.max().sort_values(ascending=True).head(6)

date
2020-01-01     3893.994129
2019-12-01     3893.994129
2009-01-01    25782.000000
2009-02-01    26660.000000
2010-01-01    34383.000000
2009-03-01    34857.000000
Name: houses_sold, dtype: float64

# Top 6 Date In Which Area Most Crimes happened ?

In [36]:
df.groupby('date').no_of_crimes.max().sort_values(ascending=True).head(6)

date
1995-01-01    2158.352063
1999-05-01    2158.352063
1999-03-01    2158.352063
1999-02-01    2158.352063
1999-01-01    2158.352063
1998-12-01    2158.352063
Name: no_of_crimes, dtype: float64

In [39]:
df[df.duplicated()]

Empty DataFrame
Columns: [date, area, average_price, code, houses_sold, no_of_crimes]
Index: []

# So No Any Duplicated records